; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=261, out_folder=./training, instance_id=47, seed=2071, goal_proportion=0.03

(define (problem blocksworld-47)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 - object)
 (:init 
    (arm-empty)
    (clear b256)
    (on b256 b139)
    (on-table b139)
    (clear b171)
    (on b171 b192)
    (on b192 b96)
    (on b96 b204)
    (on b204 b154)
    (on b154 b12)
    (on b12 b80)
    (on b80 b245)
    (on-table b245)
    (clear b57)
    (on b57 b147)
    (on b147 b169)
    (on-table b169)
    (clear b2)
    (on b2 b33)
    (on b33 b160)
    (on-table b160)
    (clear b37)
    (on b37 b203)
    (on-table b203)
    (clear b63)
    (on-table b63)
    (clear b74)
    (on b74 b95)
    (on-table b95)
    (clear b259)
    (on b259 b218)
    (on b218 b3)
    (on b3 b55)
    (on b55 b257)
    (on-table b257)
    (clear b175)
    (on-table b175)
    (clear b172)
    (on b172 b132)
    (on b132 b14)
    (on b14 b142)
    (on b142 b69)
    (on-table b69)
    (clear b157)
    (on-table b157)
    (clear b252)
    (on b252 b118)
    (on b118 b11)
    (on b11 b161)
    (on b161 b82)
    (on b82 b151)
    (on b151 b68)
    (on b68 b125)
    (on-table b125)
    (clear b121)
    (on b121 b178)
    (on b178 b149)
    (on-table b149)
    (clear b89)
    (on b89 b130)
    (on-table b130)
    (clear b238)
    (on b238 b236)
    (on b236 b133)
    (on-table b133)
    (clear b250)
    (on b250 b167)
    (on b167 b84)
    (on-table b84)
    (clear b135)
    (on b135 b48)
    (on-table b48)
    (clear b25)
    (on b25 b17)
    (on-table b17)
    (clear b261)
    (on-table b261)
    (clear b54)
    (on b54 b83)
    (on b83 b94)
    (on-table b94)
    (clear b228)
    (on b228 b202)
    (on b202 b183)
    (on-table b183)
    (clear b113)
    (on b113 b102)
    (on b102 b53)
    (on-table b53)
    (clear b253)
    (on b253 b258)
    (on-table b258)
    (clear b58)
    (on b58 b184)
    (on b184 b126)
    (on b126 b239)
    (on-table b239)
    (clear b246)
    (on b246 b112)
    (on-table b112)
    (clear b242)
    (on-table b242)
    (clear b205)
    (on b205 b122)
    (on b122 b100)
    (on-table b100)
    (clear b181)
    (on b181 b210)
    (on b210 b27)
    (on-table b27)
    (clear b13)
    (on b13 b159)
    (on b159 b219)
    (on b219 b220)
    (on b220 b59)
    (on b59 b153)
    (on b153 b224)
    (on b224 b216)
    (on-table b216)
    (clear b19)
    (on b19 b28)
    (on b28 b67)
    (on-table b67)
    (clear b137)
    (on b137 b213)
    (on-table b213)
    (clear b148)
    (on b148 b73)
    (on b73 b163)
    (on b163 b156)
    (on-table b156)
    (clear b36)
    (on-table b36)
    (clear b248)
    (on-table b248)
    (clear b123)
    (on-table b123)
    (clear b232)
    (on b232 b45)
    (on b45 b24)
    (on b24 b229)
    (on b229 b107)
    (on b107 b191)
    (on-table b191)
    (clear b212)
    (on-table b212)
    (clear b78)
    (on b78 b29)
    (on b29 b168)
    (on b168 b165)
    (on b165 b196)
    (on b196 b22)
    (on b22 b15)
    (on-table b15)
    (clear b152)
    (on b152 b97)
    (on b97 b62)
    (on b62 b110)
    (on b110 b206)
    (on b206 b41)
    (on b41 b72)
    (on b72 b227)
    (on b227 b90)
    (on-table b90)
    (clear b42)
    (on-table b42)
    (clear b197)
    (on b197 b101)
    (on b101 b194)
    (on b194 b179)
    (on b179 b111)
    (on-table b111)
    (clear b75)
    (on b75 b176)
    (on-table b176)
    (clear b26)
    (on b26 b141)
    (on b141 b7)
    (on-table b7)
    (clear b39)
    (on b39 b146)
    (on-table b146)
    (clear b255)
    (on-table b255)
    (clear b237)
    (on b237 b131)
    (on-table b131)
    (clear b190)
    (on-table b190)
    (clear b92)
    (on-table b92)
    (clear b120)
    (on b120 b185)
    (on b185 b109)
    (on b109 b223)
    (on b223 b199)
    (on b199 b174)
    (on b174 b119)
    (on-table b119)
    (clear b35)
    (on b35 b50)
    (on b50 b235)
    (on b235 b211)
    (on b211 b240)
    (on b240 b193)
    (on b193 b128)
    (on b128 b5)
    (on-table b5)
    (clear b140)
    (on b140 b31)
    (on b31 b182)
    (on b182 b34)
    (on b34 b9)
    (on-table b9)
    (clear b38)
    (on b38 b241)
    (on b241 b254)
    (on b254 b207)
    (on b207 b226)
    (on-table b226)
    (clear b108)
    (on-table b108)
    (clear b155)
    (on b155 b52)
    (on b52 b143)
    (on b143 b18)
    (on b18 b150)
    (on b150 b21)
    (on b21 b20)
    (on-table b20)
    (clear b180)
    (on b180 b106)
    (on b106 b144)
    (on-table b144)
    (clear b105)
    (on-table b105)
    (clear b195)
    (on-table b195)
    (clear b93)
    (on b93 b6)
    (on b6 b166)
    (on b166 b127)
    (on-table b127)
    (clear b56)
    (on b56 b244)
    (on-table b244)
    (clear b200)
    (on b200 b177)
    (on-table b177)
    (clear b138)
    (on b138 b187)
    (on b187 b87)
    (on-table b87)
    (clear b46)
    (on b46 b214)
    (on b214 b49)
    (on b49 b66)
    (on-table b66)
    (clear b208)
    (on-table b208)
    (clear b16)
    (on b16 b134)
    (on b134 b91)
    (on-table b91)
    (clear b104)
    (on-table b104)
    (clear b222)
    (on b222 b136)
    (on b136 b201)
    (on b201 b103)
    (on b103 b76)
    (on b76 b114)
    (on-table b114)
    (clear b225)
    (on b225 b231)
    (on b231 b71)
    (on-table b71)
    (clear b51)
    (on b51 b230)
    (on b230 b129)
    (on b129 b251)
    (on-table b251)
    (clear b215)
    (on-table b215)
    (clear b209)
    (on b209 b170)
    (on-table b170)
    (clear b189)
    (on b189 b23)
    (on b23 b186)
    (on b186 b43)
    (on b43 b32)
    (on b32 b98)
    (on-table b98)
    (clear b99)
    (on-table b99)
    (clear b65)
    (on b65 b188)
    (on-table b188)
    (clear b158)
    (on-table b158)
    (clear b4)
    (on b4 b233)
    (on b233 b124)
    (on-table b124)
    (clear b10)
    (on b10 b8)
    (on b8 b60)
    (on b60 b260)
    (on-table b260)
    (clear b81)
    (on b81 b70)
    (on-table b70)
    (clear b145)
    (on-table b145)
    (clear b86)
    (on b86 b249)
    (on b249 b162)
    (on b162 b61)
    (on b61 b198)
    (on b198 b88)
    (on b88 b116)
    (on-table b116)
    (clear b40)
    (on b40 b234)
    (on-table b234)
    (clear b77)
    (on b77 b117)
    (on b117 b47)
    (on-table b47)
    (clear b217)
    (on b217 b30)
    (on b30 b243)
    (on b243 b221)
    (on b221 b164)
    (on-table b164)
    (clear b85)
    (on b85 b173)
    (on b173 b247)
    (on b247 b44)
    (on-table b44)
    (clear b64)
    (on b64 b115)
    (on b115 b79)
    (on-table b79)
    (clear b1)
    (on-table b1))
 (:goal  (and 
    (clear b6)
    (on-table b6)
    (clear b7)
    (on-table b7)
    (clear b3)
    (on-table b3)
    (clear b4)
    (on-table b4)
    (clear b2)
    (on b2 b5)
    (on b5 b1)
    (on-table b1))))

; plan
1. (unstack b4 b233)
   deleted: (on b4 b233) (clear b4) (arm-empty)
   added: (holding b4) (clear b233)
   goals met: 3 of 12
2. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 5 of 12
3. (unstack b259 b218)
   deleted: (on b259 b218) (clear b259) (arm-empty)
   added: (holding b259) (clear b218)
   goals met: 5 of 12
4. (putdown b259)
   deleted: (holding b259)
   added: (clear b259) (arm-empty) (on-table b259)
   goals met: 5 of 12
5. (unstack b218 b3)
   deleted: (on b218 b3) (clear b218) (arm-empty)
   added: (holding b218) (clear b3)
   goals met: 6 of 12
6. (putdown b218)
   deleted: (holding b218)
   added: (clear b218) (arm-empty) (on-table b218)
   goals met: 6 of 12
7. (unstack b3 b55)
   deleted: (on b3 b55) (clear b3) (arm-empty)
   added: (holding b3) (clear b55)
   goals met: 5 of 12
8. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 7 of 12
9. (unstack b26 b141)
   deleted: (on b26 b141) (clear b26) (arm-empty)
   added: (holding b26) (clear b141)
   goals met: 7 of 12
10. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 7 of 12
11. (unstack b141 b7)
   deleted: (on b141 b7) (clear b141) (arm-empty)
   added: (holding b141) (clear b7)
   goals met: 8 of 12
12. (putdown b141)
   deleted: (holding b141)
   added: (clear b141) (arm-empty) (on-table b141)
   goals met: 8 of 12
13. (unstack b35 b50)
   deleted: (on b35 b50) (clear b35) (arm-empty)
   added: (holding b35) (clear b50)
   goals met: 8 of 12
14. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 8 of 12
15. (unstack b50 b235)
   deleted: (on b50 b235) (clear b50) (arm-empty)
   added: (holding b50) (clear b235)
   goals met: 8 of 12
16. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 8 of 12
17. (unstack b235 b211)
   deleted: (on b235 b211) (clear b235) (arm-empty)
   added: (holding b235) (clear b211)
   goals met: 8 of 12
18. (putdown b235)
   deleted: (holding b235)
   added: (clear b235) (arm-empty) (on-table b235)
   goals met: 8 of 12
19. (unstack b211 b240)
   deleted: (on b211 b240) (clear b211) (arm-empty)
   added: (holding b211) (clear b240)
   goals met: 8 of 12
20. (putdown b211)
   deleted: (holding b211)
   added: (clear b211) (arm-empty) (on-table b211)
   goals met: 8 of 12
21. (unstack b240 b193)
   deleted: (on b240 b193) (clear b240) (arm-empty)
   added: (holding b240) (clear b193)
   goals met: 8 of 12
22. (putdown b240)
   deleted: (holding b240)
   added: (clear b240) (arm-empty) (on-table b240)
   goals met: 8 of 12
23. (unstack b193 b128)
   deleted: (on b193 b128) (clear b193) (arm-empty)
   added: (holding b193) (clear b128)
   goals met: 8 of 12
24. (putdown b193)
   deleted: (holding b193)
   added: (clear b193) (arm-empty) (on-table b193)
   goals met: 8 of 12
25. (unstack b128 b5)
   deleted: (on b128 b5) (clear b128) (arm-empty)
   added: (holding b128) (clear b5)
   goals met: 8 of 12
26. (putdown b128)
   deleted: (holding b128)
   added: (clear b128) (arm-empty) (on-table b128)
   goals met: 8 of 12
27. (unstack b93 b6)
   deleted: (on b93 b6) (clear b93) (arm-empty)
   added: (holding b93) (clear b6)
   goals met: 9 of 12
28. (putdown b93)
   deleted: (holding b93)
   added: (clear b93) (arm-empty) (on-table b93)
   goals met: 9 of 12
29. (unstack b6 b166)
   deleted: (on b6 b166) (clear b6) (arm-empty)
   added: (holding b6) (clear b166)
   goals met: 8 of 12
30. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 10 of 12
31. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 10 of 12
32. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 11 of 12
33. (unstack b2 b33)
   deleted: (on b2 b33) (clear b2) (arm-empty)
   added: (holding b2) (clear b33)
   goals met: 10 of 12
34. (stack b2 b5)
   deleted: (clear b5) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b5)
   goals met: 12 of 12
